server/redux-os/app/views/directories/show.html.erb

SELECT "file_systems".* FROM "file_systems" WHERE "file_systems"."machine_readable_identifier" = $1 LIMIT $2  [["machine_readable_identifier", "local"], ["LIMIT", 1]]
---
                <% acc[i] = part_of_path %>
                <% acc[part_of_path] = File.join('/' + path.file_system.machine_readable_identifier + '/', path.split('/').take(i +  1).join('/')) %>