server/redux-os/app/controllers/directories_controller.rb

SELECT "file_systems".* FROM "file_systems" WHERE "file_systems"."machine_readable_identifier" = $1 LIMIT $2  [["machine_readable_identifier", "local"], ["LIMIT", 1]]
---
  def show
    if params[:id] =~ /\A\//
      global_dir_path = params[:id]
    else
      global_dir_path = '/local' + File.expand_path(File.join(Rails.application.root.to_s,params[:id]))
    end

    @path = EziiOsPath.new(global_dir_path)

    case @path.file_system.machine_readable_identifier
    when 'local'
      @paths = Dir
        .entries(@path.file_system_path)
        .reject do |entry|
          entry == '.' || entry == '..'
        end #
        .map do |entry|

          EziiOsPath.new(
            File.join(@path.global_path, entry)
          )